tzchuen/elec291-lab5-2019w2/Load_EFM8LB1/Load_EFM8LB1.c
    PCON|=0x80;
	SCON = 0x52;
    BDRCON=0;
	#if ((CLK/(16L*BAUD))>0x100L)
	#error "Can not set baud rate because (CLK/(16*BAUD)) > 0x100 "
	#endif
    BRL=BRG_VAL;
    BDRCON=BRR|TBCK|RBCK|SPD;

    return 0;
}

void Timer0us (unsigned char x)
{
	unsigned int j;
	
	TR0=0; // Stop timer 0
	TMOD&=0xf0; // Clear the configuration bits for timer 0
	TMOD|=0x01; // Mode 1: 16-bit timer
	
	if(x>5) x-=5; // Subtract the overhead
	else x=1;
	
	j=-ONE_USEC*x;
	TF0=0;
	TH0=j/0x100;
	TL0=j%0x100;
	TR0=1; // Start timer 0
	while(TF0==0); //Wait for overflow
}

void waitms (unsigned int ms)
{
	unsigned int j;
	unsigned char k;
	for(j=0; j<ms; j++)
		for (k=0; k<4; k++) Timer0us(250);
}

// C2 access routines

// Performs a C2 Address register read and returns the 8-bit register content
unsigned char C2_ReadAR(void)
{
   unsigned char i;
   unsigned char addr;

   // START field
   StrobeC2CK; // Strobe C2CK with C2D driver disabled
   
   // INS field (10b, LSB first)
   C2D = LOW;                       
   C2D_DriverOn; // Enable C2D driver (output)
   StrobeC2CK;
   C2D = HIGH;
   StrobeC2CK;

   C2D_DriverOff; // Disable C2D driver (input)

   // ADDRESS field
   addr = 0;
   for (i=0;i<8;i++) // Shift in 8 bit ADDRESS field LSB-first
   {
      addr >>= 1;                   
      StrobeC2CK;     
      if (C2D)
         addr |= 0x80;
   }              
   
   // STOP field
   StrobeC2CK; // Strobe C2CK with C2D driver disabled
   
   return addr; // Return Address register read value
}

// Performs a C2 Address register write (writes the <addr> input to Address register)
void C2_WriteAR(unsigned char addr)
{
   unsigned char i;
   
   // START field
   StrobeC2CK; // Strobe C2CK with C2D driver disabled

   // INS field (11b, LSB first)
   C2D = HIGH;             
   C2D_DriverOn;
   StrobeC2CK; 
   C2D = HIGH;
   StrobeC2CK;
   
   // Shift out 8-bit ADDRESS field
   for(i=0;i<8;i++)
   {
      C2D = (addr & 0x01);
      StrobeC2CK;
      addr >>= 1;
   }

   // STOP field
   C2D_DriverOff;
   StrobeC2CK;

   return;
}

// Performs a C2 Data register read and returns the 8-bit register content
unsigned char C2_ReadDR(void)
{
   unsigned char i;
   unsigned char dat; // Data register read content

   // START field
   StrobeC2CK; // Strobe C2CK with C2D driver disabled

   // INS field (00b, LSB first)
   C2D = LOW;
   C2D_DriverOn;
   StrobeC2CK;
   C2D = LOW;
   StrobeC2CK;

   // LENGTH field (00b -> 1 byte)
   C2D = LOW;
   StrobeC2CK;
   C2D = LOW;
   StrobeC2CK;

   // WAIT field
   C2D_DriverOff;
   do
   {
      StrobeC2CK;
   }
   while (!C2D); // Strobe C2CK until target transmits a '1'

   // DATA field
   dat = 0;
   for (i=0;i<8;i++) // Shift in 8-bit DATA field LSB-first
   {
      dat >>= 1;
      StrobeC2CK;
      if (C2D)
         dat  |= 0x80;
   }

   // STOP field
   StrobeC2CK;
   
   return dat;
}

// Performs a C2 Data register write (writes <dat> input to data register)
void C2_WriteDR(unsigned char dat)
{
   unsigned char i;
   
   // START field
   StrobeC2CK; // Strobe C2CK with C2D driver disabled

   // INS field (01b, LSB first)
   C2D = HIGH;
   C2D_DriverOn;
   StrobeC2CK;
   C2D = LOW;
   StrobeC2CK;
   
   // LENGTH field (00b -> 1 byte)
   C2D = LOW;
   StrobeC2CK;
   C2D = LOW;
   StrobeC2CK;
   
   // DATA field
   for (i=0;i<8;i++) // Shift out 8-bit DATA field LSB-first
   {
      C2D = (dat & 0x01);
      StrobeC2CK;
      dat >>= 1;
   }

   // WAIT field
   C2D_DriverOff; // Disable C2D driver for input
   do
   {
      StrobeC2CK; // Strobe C2CK until target transmits a '1'
   }
   while (!C2D);

   // STOP field
   StrobeC2CK; // Strobe C2CK with C2D driver disabled
   
   return;
}                    
                  
// Performs a target device reset by pulling the C2CK pin low for >20us
void C2_Reset(void)
{
   C2CK = LOW;   // Put target device in reset state by pulling
   Timer0us(20); // C2CK low for >20us
   C2CK = HIGH;  // Release target device from reset
}

// FLASH Programming Routines (High Level):
//
// These high-level routines perform the FLASH Programming Interface (FPI)
// command sequences.

void C2_WriteSFR (unsigned char sfraddress, unsigned char sfrdata)
{
   C2_WriteAR (sfraddress);
   C2_WriteDR (sfrdata);
   Poll_InBusy; // Wait for input acknowledge
}

unsigned char C2_ReadSFR (unsigned char sfraddress)
{
   unsigned char j;
   C2_WriteAR (sfraddress);
   j=C2_ReadDR ();
   Poll_InBusy; // Wait for input acknowledge
   return j;
}

// C2_Init: Initializes the C2 Interface for FLASH programming
void C2_Init(void)
{
   C2_Reset();    // Reset the target device
   Timer0us(2);   // Delay for at least 2us
 
   // FPCTL: Flash Programming Control Register.
   // This register is used to enable Flash programming via the C2 interface. To enable C2
   // Flash programming, the following codes must be written in order: 0x02, 0x01. Note
   // that once C2 Flash programming is enabled, a system reset must be issued to
   // resume normal operation.
   
   C2_WriteAR(FPCTL); // Target the C2 FLASH Programming Control register (FPCTL)
   C2_WriteDR(0x02);  // Write the first key code to enable C2 FLASH programming
   C2_WriteDR(0x01);  // Write the second key code to enable C2 FLASH programming
   waitms(20);        // Delay for at least 20ms to ensure the target is ready for C2 FLASH programming
   
   // EFM8LB1 Device-Specific Programming Sequences.  This comes from
   // Silabs' Application Note AN127:
   // VDD Monitor Initialization:
   C2_WriteSFR(0xFF, 0x80);
   Timer0us(5); //Delay 5 us
   C2_WriteSFR(0xEF, 0x02);
   // Oscillator Initialization:
   C2_WriteSFR(0xA9, 0x00);
}

// C2_GetDevID:  Reads the target Device ID register
unsigned char C2_GetDevID(void)
{
   C2_WriteAR(DEVICEID); // Select DeviceID register for C2 Data register accesses
   return C2_ReadDR();   // Read and return the DeviceID register
}

// C2_GetRevID: Reads Revision ID register
unsigned char C2_GetRevID(void)
{
   C2_WriteAR(REVID);   // Select REVID regsiter for C2 Data register accesses
   return C2_ReadDR();  // Read and return the DeviceID register
}

// C2_BlockRead:
// - Reads a block of FLASH memory starting at <FLASH_ADDR>
// - The size of the block is defined by <NUM_BYTES>
// - Stores the read data at the location targeted by the pointer <C2_PTR>
// - Assumes that FLASH accesses via C2 have been enabled prior to the function call
// - Function call returns a '1' if successful; returns a '0' if unsuccessful
//
char C2_BlockRead(void)
{
   unsigned char i;        // Counter
   unsigned char status;   // FPI status information holder

   C2_WriteAR(FPDAT);      // Select the FLASH Programming Data register for C2 Data register accesses
   C2_WriteDR(BLOCK_READ); // Send FLASH block read command
   Poll_InBusy;            // Wait for input acknowledge

   // Check status before starting FLASH access sequence
   Poll_OutReady;                      // Wait for status information
   status = C2_ReadDR();               // Read FLASH programming interface status
   if (status != COMMAND_OK) return 0; // Exit and indicate error
   
   C2_WriteDR(FLASH_ADDR >> 8);        // Send address high byte to FPDAT
   Poll_InBusy;                        // Wait for input acknowledge
   C2_WriteDR(FLASH_ADDR & 0x00FF);    // Send address low byte to FPDAT
   Poll_InBusy;                        // Wait for input acknowledge
   C2_WriteDR(NUM_BYTES);              // Send block size
   Poll_InBusy;                        // Wait for input acknowledge

