tzchuen/elec291-lab5-2019w2/Load_EFM8LB1/Load_EFM8LB1.c
   // Check status before reading FLASH block
   Poll_OutReady;                      // Wait for status information
   status = C2_ReadDR();               // Read FLASH programming interface status
   if (status != COMMAND_OK)
      return 0;                        // Exit and indicate error
   
   // Read FLASH block
   for (i=0;i<NUM_BYTES;i++)
   {
      Poll_OutReady;                   // Wait for data ready indicator
      *C2_PTR++ = C2_ReadDR();         // Read data from the FPDAT register
   }
   return 1;                           // Exit and indicate success
}

// C2_BlockWrite:
// - Writes a block of FLASH memory starting at <FLASH_ADDR>
// - The size of the block is defined by <NUM_BYTES>
// - Writes the block stored at the location targetted by <C2_PTR>
// - Assumes that FLASH accesses via C2 have been enabled prior to the function call
// - Function call returns a '1' if successful; returns a '0' if unsuccessful
//
char C2_BlockWrite(void)
{
   unsigned char i;                    // Counter
   unsigned char status;               // FPI status information holder

   C2_WriteAR(FPDAT);                  // Select the FLASH Programming Data register 
                                       // for C2 Data register accesses
   C2_WriteDR(BLOCK_WRITE);            // Send FLASH block write command
   Poll_InBusy;                        // Wait for input acknowledge

   // Check status before starting FLASH access sequence
   Poll_OutReady;                      // Wait for status information
   status = C2_ReadDR();               // Read FLASH programming interface status
   if (status != COMMAND_OK)
      return 0;                        // Exit and indicate error

   C2_WriteDR(FLASH_ADDR >> 8);        // Send address high byte to FPDAT
   Poll_InBusy;                        // Wait for input acknowledge
   C2_WriteDR(FLASH_ADDR & 0x00FF);    // Send address low byte to FPDAT
   Poll_InBusy;                        // Wait for input acknowledge
   C2_WriteDR(NUM_BYTES);              // Send block size
   Poll_InBusy;                        // Wait for input acknolwedge

   // Check status before writing FLASH block
   Poll_OutReady;                      // Wait for status information
   status = C2_ReadDR();               // Read FLASH programming interface status
   if (status != COMMAND_OK)
      return 0;                        // Exit and indicate error

   // Write FLASH block
   for (i=0;i<NUM_BYTES;i++)
   {
      C2_WriteDR(*C2_PTR++);           // Write data to the FPDAT register
      Poll_InBusy;                     // Wait for input acknowledge
   }   

   Poll_OutReady;                      // Wait for last FLASH write to complete
   return 1;                           // Exit and indicate success
}

// C2_PageErase:
// - Erases a 512-byte FLASH page
// - Targets the FLASH page containing the address <FLASH_ADDR>
// - Assumes that FLASH accesses via C2 have been enabled prior to the function call
// - Function call returns a '1' if successful; returns a '0' if unsuccessful
char C2_PageErase(void)
{
   unsigned char page;                 // Target FLASH page
   unsigned char status;               // FPI status information holder

   page=(unsigned char)(FLASH_ADDR>>9);// <page> is the 512-byte sector containing the target <FLASH_ADDR>.

   if (page >= (NUM_PAGES-2))          // Check that target page is within range (NUM_PAGES minus 2 for reserved area)
      return 0;                        // Indicate error if out of range
   C2_WriteAR(FPDAT);                  // Select the FLASH Programming Data register for C2 Data register accesses
   C2_WriteDR(PAGE_ERASE);             // Send FLASH page erase command Wait for input acknowledge

   // Check status before starting FLASH access sequence
   Poll_OutReady;                      // Wait for status information
   status = C2_ReadDR();               // Read FLASH programming interface status
   if (status != COMMAND_OK)
      return 0;                        // Exit and indicate error
   
   C2_WriteDR(page);                   // Send FLASH page number
   Poll_InBusy;                        // Wait for input acknowledge

   Poll_OutReady;                      // Wait for ready indicator
   status = C2_ReadDR();               // Read FLASH programming interface status
   if (status != COMMAND_OK)
      return 0;                        // Exit and indicate error
   
   C2_WriteDR(0x00);                   // Dummy write to initiate erase
   Poll_InBusy;                        // Wait for input acknowledge

   Poll_OutReady;                      // Wait for erase operation to complete
   return 1;                           // Exit and indicate success
}

// C2_Device_Erase:
// - Erases the entire FLASH memory space
// - Assumes that FLASH accesses via C2 have been enabled prior to the function call
// - Function call returns a '1' if successful; returns a '0' if unsuccessful
char C2_DeviceErase(void)
{
   unsigned char status;       // FPI status information holder

   C2_WriteAR(FPDAT);          // Select the FLASH Programming Data register for C2 Data register accesses
   C2_WriteDR(DEVICE_ERASE);   // Send Device Erase command
   Poll_InBusy;                // Wait for input acknowledge

   // Check status before starting FLASH access sequence
   Poll_OutReady;               // Wait for status information
   status = C2_ReadDR();        // Read FLASH programming interface status
   if (status != COMMAND_OK)
      return 0;                 // Exit and indicate error

   // Send a three-byte arming sequence to enable the device erase. If the sequence
   // is not received correctly, the command will be ignored.
   // Sequence: 0xDE, 0xAD, 0xA5.
   C2_WriteDR(0xDE);  // Arming sequence command 1
   Poll_InBusy;       // Wait for input acknowledge

   C2_WriteDR(0xAD);  // Arming sequence command 2
   Poll_InBusy;       // Wait for input acknowledge

   C2_WriteDR(0xA5);  // Arming sequence command 3
   Poll_InBusy;       // Wait for input acknowledge

   Poll_OutReady;     // Wait for erase operation to complete

   return 1;          // Exit and indicate success
}

void main (void)
{
	unsigned int i, j, k; // Misc. counters

	printf("\x1b[2JThis program loads the bootloader into a EFM8LB1 using an AT89LP51RC2.\n"
	       "Based on Cygnal application note AN027 and Silicon Labs application note AN127\n"
		   "By Jesus Calvino-Fraga (2008-2018)\n");
	
	while(1)
	{
	    printf("\nPress the 'BOOT' button (connected to P4.5) to start.\n\n");
		RLED=LEDOFF;
		GLED=LEDOFF;
		YLED=LEDOFF;
		C2D_DriverOn;
		C2CK=LOW;
		C2D=LOW;
		PWR=PWROFF; // Power-off device
		
