tzchuen/elec291-lab5-2019w2/Load_EFM8LB1/Load_EFM8LB1.c
		while(FGO==1) // Blinking Green LED indicates new device can be inserted
		{
			GLED=(!GLED);
			YLED=(!YLED);
			waitms(300);
		}
		GLED=LEDON;
		YLED=LEDON;
		PWR=PWRON; // Power-on device
		waitms(300);
		C2D_DriverOff;
		C2CK=HIGH;
		while(FGO==0);
		GLED=LEDOFF;
		YLED=LEDOFF;
		
		// Read Device ID
		C2_Reset();        // Reset target
		j = C2_GetDevID(); 
   
		printf("Checking for EFM8LB1 microcontroller...");
		if (j != id[1].device_id)
		{
			printf("\nERROR: EFM8LB1 device not present!\n");
			RLED=LEDON;
			goto the_end;
		}
		printf(" Done.\n");
		
		j = C2_ReadSFR(0xAD);
		printf("Checking for %s microcontroller...", id[1].description);
		if (j != id[1].derivative_id)
		{
			printf("\nERROR: %s device not present! (%02x)\n", id[1].description, j);
			RLED=LEDON;
			goto the_end;
		}
		printf(" Done.\n");
		
		// Initiate C2 FLASH Programming
		C2_Reset();  // Start with a target device reset
		C2_Init();   // Enable FLASH programming via C2
		
		printf("Erasing the flash memory...");
		C2_DeviceErase(); // Erase entire code space
		printf(" Done.\n");
		
		printf("Verifying that the flash memory is blank...");
		// Read back entire FLASH memory (should be all '1's)
		for (i=NUM_BLOCKS-(PAGE_SIZE/BLOCK_SIZE); i<NUM_BLOCKS; i++) // Perform block reads (0x0000 to 0xFBFF)
		{
			FLASH_ADDR = i*BLOCK_SIZE;    // Set target addresss
			NUM_BYTES = BLOCK_SIZE;       // Set number of bytes to read
			C2_PTR = R_BUF;               // Initialize C2 pointer to the read buffer
			C2_BlockRead();               // Initiate FLASH read            
			for (j=0; j<BLOCK_SIZE; j++)  // Check read data
			{
				if (R_BUF[j] != 0xFF)
				{
					printf("\nERROR: flash memory is not blank. @%04x=%02x\n", FLASH_ADDR+j, R_BUF[j]);
					RLED=LEDON;
					goto the_end;
				}
			}
		}
		printf(" Done.\n");

		printf("Copying bootloader to target");
		for (i=NUM_BLOCKS-(PAGE_SIZE/BLOCK_SIZE), k=0; i<NUM_BLOCKS; i++, k++) // Perform block write/reads
		{
			// Write FLASH block
			FLASH_ADDR = i*BLOCK_SIZE;
			NUM_BYTES = BLOCK_SIZE;
			memcpy(W_BUF, &Bootloader[k*BLOCK_SIZE], BLOCK_SIZE);

			C2_PTR = W_BUF;
			C2_BlockWrite();
		
			// Read back FLASH block
			FLASH_ADDR = i*BLOCK_SIZE;
			NUM_BYTES = BLOCK_SIZE;
			C2_PTR = R_BUF;
			C2_BlockRead();
			
			if (memcmp(R_BUF, W_BUF, BLOCK_SIZE) != 0) // Verify written bytes
			{
				printf("\nERROR: Memory flash failed.\n");
				RLED=LEDON;
				goto the_end;
			}
			else
			{
			    putchar('.');
			}
		}
	
		printf(" Done.\n");
	    printf("\n\nPress the 'BOOT' button to finish.\n");
		GLED=LEDON;
		YLED=LEDON;
		C2_Reset();
				
		the_end:
		
		//Display the result of the flashing proccess until button pressed
		while(FGO==1);
		waitms(100); //Debounce...
		while(FGO==0);
		waitms(100); //Debounce...
	}
}   

